List<Map<String, dynamic>> faqList = [
  {
    "id": 11,
    "question": "ما هي منصة حفاظ المتون؟",
    "answer":
        "هي منصة تعتني بتسهيل وضبط سبل إتقان حفظ المتون الشرعية، وتيسيره على طالب العلم وبالطريقة التي تتناسب معه.",
    "created_at": "2021-09-16T13:32:44.000000Z",
    "updated_at": "2021-09-16T13:32:44.000000Z"
  },
  {
    "id": 12,
    "question": "لماذا تطبيق حفاظ المتون؟",
    "answer":
        "في الأزمنة المتسارعة التي نعيشها، وكثرة الملهيات والعوارض والانشغال بأمور الحياة ومتطلباتها، يصعب على كثير من طلبة العلم مواصلة الطلب ومعاهدة الحفظ والتكرار، فجاءت فكرة منصة حفاظ المتون، لتقدم لطلبة العلم أداة مساعدة تعينهم على الحفظ والتكرار، وتنظيم أورادهم، والتذكير بها، فيكون الحفظ جزء أساسي من روتين الطالب اليومي فيسهل عليه ويصبح عادة تلقائية، ومع المداومة والتكرار يجد الطالب نفسه قد حصل متون كثيرة تكون له بمثابة أصول في العلوم يفرع عليها، ويستحضرها في أي وقت، وكما قيل: (من حفظ المتون حاز الفنون).",
    "created_at": "2021-09-16T13:34:14.000000Z",
    "updated_at": "2021-09-16T13:34:14.000000Z"
  },
  {
    "id": 13,
    "question": "ما مميزات تطبيق حفاظ المتون؟",
    "answer":
        "- تغطية معظم المتون الهامة التي كتب لها القبول في الأوساط العلمية.\n- التذكير بالورد حفظاً ومراجعة.\n- المرونة: فيمكنك تحديد أوقات وكمية الحفظ المناسبة.\n- اختيار من بين أكثر من قارئ للمتن.\n- تحديد عدد التكرار المناسب لك، وحسب صعوبته.\n- تنوع المتون ومستوياتها في الفن الواحد.\n- تجمع محفوظاتك في مكان واحد بشكل مرتب ومنظم.\n- اختبار حفظك يعد إتمام حفظ الورد.\n- عرض نقاط ضعفك في المحفوظ.\n- يسجل لك التطبيق تقرير بمنجزاتك في الحفظ.\n-تحصل على شهادة حفظ في نهاية المتن.",
    "created_at": "2021-09-16T13:51:47.000000Z",
    "updated_at": "2021-09-16T13:51:47.000000Z"
  },
  {
    "id": 14,
    "question": "كيف أحقق أكبر استفادة من الدارسة على طريقة المتون؟",
    "answer":
        "نجيب على هذا السؤال بكلام العلامة ابن بدران في هذا السياق، يقول: ((فاعلم أننا اهتدينا بفضله تعالى أثناء الطلب إلى قاعدة وهي أننا كنا نأتي إلى المتن أولاً فنأخذ منه جملة كافية للدرس ثم نشتغل بحل تلك الجملة من غير نظر إلى شرحها. ونزاولها حتى نظن أننا فهمناها ثم نقبل على الشرح فنطالعه المطالعة الأولى امتحاناً لفهمنا، فإن وجدنا فيما فهمناه غلطاً صححناه ثم أقبلنا على تفهم الشرح على نمط ما فعلناه في المتن. ثم إذا ظننا أننا فهمناه راجعنا حاشيته –إن كان له حاشية- مراجعة امتحان لفكرنا، فإذا علمنا أننا فهمنا الدرس تركنا الكتاب واشتغلنا بتصوير مسائله في ذهننا فحفظناه حفظ فهم وتصور لا حفظ تراكيب وألفاظ، ثم نجتهد على أداء معناه بعبارات من عندنا غير ملتزمين تراكيب المؤلف، ثم نذهب إلى الأستاذ للقراءة وهنالك نمتحن فكرنا في حل الدرس ونقوَّم ما عساه أن يكون به من اعوجاج ونوفر الهمة على ما يورده الأستاذ مما هو زائد على المتن والشرح، وكنا نرى أن من قرأ كتاباً واحدا من فن على هذه الطريقة سهل عليه جميع كتب هذا مختصراتها ومطولاتها وثبتت قواعده في ذهنه وكان الأمر على ذلك)). المدخل إلى مذهب الإمام أحمد.",
    "created_at": "2021-09-16T13:58:02.000000Z",
    "updated_at": "2021-09-16T13:58:02.000000Z"
  },
  {
    "id": 15,
    "question": "لماذا احفظ المتون؟",
    "answer":
        "حفظ المتون لطالب العلم هي من الطرق القديمة التي اعتمد عليها الكثير من أهل العلم، لما فيها من الفوائد الجمة، فمن فوائد حفظ المتون:\n- حفظ المتون يجمع لك العلوم في رأسك.\n- يسهل عليك استحضار المعلومات كما تشاء بسهولة.\n- تجمع لك أصول العلم، فلا يفوتك شيء من أصوله.\n- تختصر عليك الطريق، بجمع شتات العلم في زبد وخلاصات.\n- ضبط العلوم وإتقانها.\n- آفة العلم النسيان، فقد يبذل الإنسان جهدًا كبيرًا في طلب العلم ولما ينشغل عنه لعارض أو غير ذلك؛ يجد نفسه قد نسي ما حصله، أما الحفظ المتين للمتون يكون معك كالذخيرة التي تنفجر باستشراحها.",
    "created_at": "2021-09-16T13:58:44.000000Z",
    "updated_at": "2021-09-16T13:58:44.000000Z"
  },
  {
    "id": 16,
    "question": "هل يمكن حفظ أكثر من متن في نفس الوقت؟",
    "answer":
        "نعم، هذا يتوفر في البرنامج بالضغط على \"قائمة المتون\" ثم اختيار المتن والضغط على \"حفظ جديد\" أو \"مراجعة\"، وهكذا مع باقي المتون.",
    "created_at": "2021-09-16T13:59:24.000000Z",
    "updated_at": "2021-09-16T13:59:24.000000Z"
  },
  {
    "id": 17,
    "question": "هل ستتوفر متون أخرى لاحقًا أم الموجود فقط؟",
    "answer":
        "يتم تحديث وإضافة متون وصوتيات جديدة على مراحل متعددة باستمرار إن شاء الله.",
    "created_at": "2021-09-16T13:59:52.000000Z",
    "updated_at": "2021-09-16T13:59:52.000000Z"
  },
  {
    "id": 18,
    "question": "هل يمكن للمستخدم إضافة متون غير موجودة في التطبيق؟",
    "answer":
        "لا، ولكن يتاح طلب المتون عبر الموقع أو بوت التليجرام وفي حالة الموافقة سيدرج في المرحلة القادمة إن شاء الله.",
    "created_at": "2021-09-16T14:09:56.000000Z",
    "updated_at": "2021-09-16T14:09:56.000000Z"
  },
  {
    "id": 19,
    "question": "هل يوجد تمارين واختبارات للحفظ؟",
    "answer":
        "نعم، يوفر تطبيق حفاظ المتون اختبارات بعد كل ورد سواء المراجعة أو الحفظ حتى يقيم الطالب حفظه ويقف على نقاط ضعفه، ويسجل التطبيق نفاط الضعف وتعرض للطالب مع تقرير بما تم إنجازه.",
    "created_at": "2021-09-16T14:10:21.000000Z",
    "updated_at": "2021-09-16T14:10:21.000000Z"
  },
  {
    "id": 20,
    "question": "هل يوفر التطبيق مجموعات للحفظ؟",
    "answer":
        "سيتم توفير قسم خاص للمجموعات الخاصة والعامة في حفظ المتون في التحديثات اللاحقة إن شاء الله.",
    "created_at": "2021-09-16T14:10:41.000000Z",
    "updated_at": "2021-09-16T14:10:41.000000Z"
  },
  {
    "id": 21,
    "question": "كيف أحقق أكبر استفادة من التطبيق؟",
    "answer":
        "في البداية لابد لطالب العلم إخلاص النية لله عز وجل، وأن يسأله التوفيق والسداد، وأن يكون جادًا في طلبه حريصاً على وقته عالما بمنزلة وشرف طلب العلم. إن تطبيق حفاظ المتون أداة تساعد في تكوين عادة من عادات التعلم وهي الحفظ، فينبغي لطالب العلم أن يكون واقعي في اختياره للمتن المناسب لمرحلته، واختيار الكم المحفوظ بواقعية بما يتناسب مع ظروفه الحياتية والعملية؛ فلا يختار كمية كبيرة من الحفظ وهو فوق قدرته ووقته فصاب بالإحباط لعدم قدرته على إنجاز مهمته فينقطع، وكما قيل قليل دائم خير من كثير منقطع. وأن يصبر على تكوين عادة حفظ المتون حتى تصير أمر روتيني له فيسهل عليه فعله والمداومة عليه فيجني ثمار حفظه.",
    "created_at": "2021-09-16T14:11:07.000000Z",
    "updated_at": "2021-09-16T14:11:07.000000Z"
  }
];
